//Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.

// Console.WriteLine("Введите число");

// int num = Convert.ToInt32(Console.ReadLine());

// if(num % 7 == 0 && num % 23 == 0)
// {
//     Console.WriteLine("Число кратно 7 и 23");
// }
// else
// {
//     Console.WriteLine("Число не кратно 7 и 23");
// }


//Напишите программу, которая принимает на вход координаты точки (X и Y), 
//причём X ≠ 0 и Y ≠ 0 и выдаёт номер координатной четверти плоскости, в которой находится эта точка.

// Console.WriteLine("Введите координату Х ");

// int x = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите координату Y ");

// int y = Convert.ToInt32(Console.ReadLine());

// if(x == 0 || y == 0)
// {
//     Console.WriteLine("Координаты не должны быть = 0");
// }

// if(x > 0 && y > 0)
// {
//     Console.WriteLine("Первая четверть");
// }

// if(x > 0 && y < 0)
// {
//     Console.WriteLine("Вторая четверть");
// }

// if(x < 0 && y < 0)
// {
//     Console.WriteLine("Третья четверть");
// }

// if(x < 0 && y > 0)
// {
//     Console.WriteLine("Четвертая четверть");
// }



//Напишите программу, которая принимает на вход целое число из отрезка [10, 99] и показывает наибольшую цифру числа.

// Console.WriteLine("Введите число от 10 до 99");

// int num1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine(num1%10);



//Напишите программу, которая на вход принимает натуральное число N, а на выходе показывает его цифры через запятую.

// Console.WriteLine("Введите натуральное число");
// int x = Convert.ToInt32(Console.ReadLine());

// while(x > 0)
// {
//     Console.Write(x%10 + ",");
//     x = x/10;
// }



